MikroElektronika/core_packages/ARM/gcc_clang/def/holtek/HT32F1765-48QFN/mcu.h
#define HT_SRAM_BASE             ((u32)0x20000000)
#define HT_SRAM_BB_BASE          ((u32)0x22000000)

#define HT_PERIPH_BASE           ((u32)0x40000000)
#define HT_PERIPH_BB_BASE        ((u32)0x42000000)

#define HT_APB0PERIPH_BASE       (HT_PERIPH_BASE)                 /* 0x40000000                             */
#define HT_APB1PERIPH_BASE       (HT_PERIPH_BASE + 0x40000)       /* 0x40040000                             */
#define HT_AHBPERIPH_BASE        (HT_PERIPH_BASE + 0x80000)       /* 0x40080000                             */

/* APB0                                                                                                     */
#define HT_USART0_BASE           (HT_APB0PERIPH_BASE + 0x0000)    /* 0x40000000                             */
#define HT_SPI0_BASE             (HT_APB0PERIPH_BASE + 0x4000)    /* 0x40004000                             */
#define HT_ADC_BASE              (HT_APB0PERIPH_BASE + 0x10000)   /* 0x40010000                             */
#define HT_CMP_OP0_BASE          (HT_APB0PERIPH_BASE + 0x18000)   /* 0x40018000                             */
#define HT_CMP_OP1_BASE          (HT_APB0PERIPH_BASE + 0x18100)   /* 0x40018100                             */
#define HT_GPIOA_BASE            (HT_APB0PERIPH_BASE + 0x1A000)   /* 0x4001A000                             */
#define HT_GPIOB_BASE            (HT_APB0PERIPH_BASE + 0x1B000)   /* 0x4001B000                             */
#define HT_GPIOC_BASE            (HT_APB0PERIPH_BASE + 0x1C000)   /* 0x4001C000                             */
#define HT_GPIOD_BASE            (HT_APB0PERIPH_BASE + 0x1D000)   /* 0x4001D000                             */
#define HT_GPIOE_BASE            (HT_APB0PERIPH_BASE + 0x1E000)   /* 0x4001E000                             */
#define HT_AFIO_BASE             (HT_APB0PERIPH_BASE + 0x22000)   /* 0x40022000                             */
#define HT_EXTI_BASE             (HT_APB0PERIPH_BASE + 0x24000)   /* 0x40024000                             */
#define HT_MCTM_BASE             (HT_APB0PERIPH_BASE + 0x2C000)   /* 0x4002C000                             */

/* APB1                                                                                                     */
#define HT_USART1_BASE           (HT_APB1PERIPH_BASE + 0x0000)    /* 0x40040000                             */
#define HT_SCI_BASE              (HT_APB1PERIPH_BASE + 0x3000)    /* 0x40043000                             */
#define HT_SPI1_BASE             (HT_APB1PERIPH_BASE + 0x4000)    /* 0x40044000                             */
#define HT_I2C0_BASE             (HT_APB1PERIPH_BASE + 0x8000)    /* 0x40048000                             */
#define HT_I2C1_BASE             (HT_APB1PERIPH_BASE + 0x9000)    /* 0x40049000                             */
#define HT_USB_BASE              (HT_APB1PERIPH_BASE + 0xE000)    /* 0x4004E000                             */
#define HT_USB_EP0_BASE          (HT_USB_BASE        + 0x0014)    /* 0x4004E014                             */
#define HT_USB_EP1_BASE          (HT_USB_BASE        + 0x0028)    /* 0x4004E028                             */
#define HT_USB_EP2_BASE          (HT_USB_BASE        + 0x003C)    /* 0x4004E03C                             */
#define HT_USB_EP3_BASE          (HT_USB_BASE        + 0x0050)    /* 0x4004E050                             */
#define HT_USB_EP4_BASE          (HT_USB_BASE        + 0x0064)    /* 0x4004E064                             */
#define HT_USB_EP5_BASE          (HT_USB_BASE        + 0x0078)    /* 0x4004E078                             */
#define HT_USB_EP6_BASE          (HT_USB_BASE        + 0x008C)    /* 0x4004E08C                             */
#define HT_USB_EP7_BASE          (HT_USB_BASE        + 0x00A0)    /* 0x4004E0A0                             */
#define HT_USB_SRAM_BASE         (HT_APB1PERIPH_BASE + 0xE400)    /* 0x4004E400                             */
#define HT_WDT_BASE              (HT_APB1PERIPH_BASE + 0x28000)   /* 0x40068000                             */
#define HT_RTC_BASE              (HT_APB1PERIPH_BASE + 0x2A000)   /* 0x4006A000                             */
#define HT_PWRCU_BASE            (HT_APB1PERIPH_BASE + 0x2A100)   /* 0x4006A100                             */
#define HT_GPTM0_BASE            (HT_APB1PERIPH_BASE + 0x2E000)   /* 0x4006E000                             */
#define HT_GPTM1_BASE            (HT_APB1PERIPH_BASE + 0x2F000)   /* 0x4006F000                             */
#define HT_BFTM0_BASE            (HT_APB1PERIPH_BASE + 0x36000)   /* 0x40076000                             */
#define HT_BFTM1_BASE            (HT_APB1PERIPH_BASE + 0x37000)   /* 0x40077000                             */

/* AHB                                                                                                      */
#define HT_FLASH_BASE            (HT_AHBPERIPH_BASE + 0x0000)     /* 0x40080000                             */
#define HT_CKCU_BASE             (HT_AHBPERIPH_BASE + 0x8000)     /* 0x40088000                             */
#define HT_RSTCU_BASE            (HT_AHBPERIPH_BASE + 0x8100)     /* 0x40088100                             */
#define HT_PDMA_BASE             (HT_AHBPERIPH_BASE + 0x10000)    /* 0x40090000                             */
#define HT_CSIF_BASE             (HT_AHBPERIPH_BASE + 0x4C000)    /* 0x400CC000                             */



/**
  * @}
  */

/* Peripheral declaration                                                                                   */
#define HT_USART0              ((HT_USART_TypeDef *) HT_USART0_BASE)
#define HT_USART1              ((HT_USART_TypeDef *) HT_USART1_BASE)
#define HT_SPI0                ((HT_SPI_TypeDef *) HT_SPI0_BASE)
#define HT_SPI1                ((HT_SPI_TypeDef *) HT_SPI1_BASE)
#define HT_ADC                 ((HT_ADC_TypeDef *) HT_ADC_BASE)
#define HT_CMP_OP0             ((HT_CMP_OP_TypeDef *) HT_CMP_OP0_BASE)
#define HT_CMP_OP1             ((HT_CMP_OP_TypeDef *) HT_CMP_OP1_BASE)
#define HT_AFIO                ((HT_AFIO_TypeDef *) HT_AFIO_BASE)
#define HT_GPIOA               ((HT_GPIO_TypeDef *) HT_GPIOA_BASE)
#define HT_GPIOB               ((HT_GPIO_TypeDef *) HT_GPIOB_BASE)
#define HT_GPIOC               ((HT_GPIO_TypeDef *) HT_GPIOC_BASE)
#define HT_GPIOD               ((HT_GPIO_TypeDef *) HT_GPIOD_BASE)
#define HT_GPIOE               ((HT_GPIO_TypeDef *) HT_GPIOE_BASE)
#define HT_EXTI                ((HT_EXTI_TypeDef *) HT_EXTI_BASE)
#define HT_MCTM                ((HT_MCTM_TypeDef *) HT_MCTM_BASE)
#define HT_SCI                 ((HT_SCI_TypeDef *) HT_SCI_BASE)
#define HT_I2C0                ((HT_I2C_TypeDef *) HT_I2C0_BASE)
#define HT_I2C1                ((HT_I2C_TypeDef *) HT_I2C1_BASE)
#define HT_USB                 ((HT_USB_TypeDef *) HT_USB_BASE)
#define HT_USBEP0              ((HT_USBEP_TypeDef *) HT_USB_EP0_BASE)
#define HT_USBEP1              ((HT_USBEP_TypeDef *) HT_USB_EP1_BASE)
#define HT_USBEP2              ((HT_USBEP_TypeDef *) HT_USB_EP2_BASE)
#define HT_USBEP3              ((HT_USBEP_TypeDef *) HT_USB_EP3_BASE)
#define HT_USBEP4              ((HT_USBEP_TypeDef *) HT_USB_EP4_BASE)
#define HT_USBEP5              ((HT_USBEP_TypeDef *) HT_USB_EP5_BASE)
#define HT_USBEP6              ((HT_USBEP_TypeDef *) HT_USB_EP6_BASE)
#define HT_USBEP7              ((HT_USBEP_TypeDef *) HT_USB_EP7_BASE)
#define HT_WDT                 ((HT_WDT_TypeDef *) HT_WDT_BASE)
#define HT_RTC                 ((HT_RTC_TypeDef *) HT_RTC_BASE)
#define HT_PWRCU               ((HT_PWRCU_TypeDef *) HT_PWRCU_BASE)
#define HT_GPTM0               ((HT_GPTM_TypeDef *) HT_GPTM0_BASE)
#define HT_GPTM1               ((HT_GPTM_TypeDef *) HT_GPTM1_BASE)
#define HT_BFTM0               ((HT_BFTM_TypeDef *) HT_BFTM0_BASE)
#define HT_BFTM1               ((HT_BFTM_TypeDef *) HT_BFTM1_BASE)
#define HT_FLASH               ((HT_FLASH_TypeDef *) HT_FLASH_BASE)
#define HT_CKCU                ((HT_CKCU_TypeDef *) HT_CKCU_BASE)
#define HT_RSTCU               ((HT_RSTCU_TypeDef *) HT_RSTCU_BASE)
#define HT_PDMA                ((HT_PDMA_TypeDef *) HT_PDMA_BASE)
#define HT_CSIF                ((HT_CSIF_TypeDef *) HT_CSIF_BASE)


#if defined USE_HT32_DRIVER
//  #include "ht32f175x_275x_lib.h"// Note: Changed for MikroE implementation.
#endif


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif  /* __HT32F175x_275x_H__                                                                             */


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
